Public Member Functions | Public Attributes | List of all members
API_NavigatorAddOnViewPointData Struct Reference
Project Navigator
Describes a Navigator AddOn viewpoint root, group or leaf node. More...
#include <APIdefs_Navigator.h>
 Public Member Functions
API_NavigatorAddOnViewPointData ()
API_NavigatorAddOnViewPointData (const API_NavigatorAddOnViewPointData &source)
API_NavigatorAddOnViewPointData (API_NavigatorAddOnViewPointData &&source)
void  | operator= (const API_NavigatorAddOnViewPointData &source)
void  | operator= (API_NavigatorAddOnViewPointData &&source)
~API_NavigatorAddOnViewPointData ()
 Public Attributes
GS::UniString  | displayId
The display ID of the viewpoint.
GS::UniString  | displayName
The display name of the viewpoint.
API_NavigatorAddOnViewPointTypeID  | itemType
The type of the viewpoint: root, group or leaf node. See API_NavigatorAddOnViewPointTypeID.
Int32  | iconId
API_Guid  | guid
Unique ID of the viewpoint.
API_Guid  | parentGuid
Unique ID of the parent root/group of the viewpoint. The parent of a root is APINULLGuid.
GSHandle  | data
The data stored by the AddOn in this viewpoint.
UInt32  | viewSettingsFlags
Specifies which view settings are enabled in this viewpoint leaf node. Not applicable for viewpoint roots or groups. The value of this member can be set by combining the flags in API_NavigatorViewSettingsFlags.
Detailed Description
Describes a Navigator AddOn viewpoint root, group or leaf node.
Remarks
This is not POD type.
Do not use memset, BNZeroMemory or BNClear to initialize an object of this class. The constructors will initialize it.
Do not use BMKillHandle or BMHandleToHandle to manage the lifetime of the data member. The constructors, destructors and assignment operators of the class will manage it.
Constructor & Destructor Documentation
◆ API_NavigatorAddOnViewPointData() [1/3]
 API_NavigatorAddOnViewPointData::API_NavigatorAddOnViewPointData  |  ( |   | )
inline
◆ API_NavigatorAddOnViewPointData() [2/3]
 API_NavigatorAddOnViewPointData::API_NavigatorAddOnViewPointData  |  ( |  const API_NavigatorAddOnViewPointData &  |  source | )
inline
◆ API_NavigatorAddOnViewPointData() [3/3]
 API_NavigatorAddOnViewPointData::API_NavigatorAddOnViewPointData  |  ( |  API_NavigatorAddOnViewPointData &&  |  source | )
inline
◆ ~API_NavigatorAddOnViewPointData()
 API_NavigatorAddOnViewPointData::~API_NavigatorAddOnViewPointData  |  ( |   | )
inline
Member Function Documentation
◆ operator=() [1/2]
 void API_NavigatorAddOnViewPointData::operator=  |  ( |  API_NavigatorAddOnViewPointData &&  |  source | )
inline
◆ operator=() [2/2]
 void API_NavigatorAddOnViewPointData::operator=  |  ( |  const API_NavigatorAddOnViewPointData &  |  source | )
inline
Member Data Documentation
◆ data
 API_NavigatorAddOnViewPointData::data
The data stored by the AddOn in this viewpoint.
◆ displayId
 API_NavigatorAddOnViewPointData::displayId
The display ID of the viewpoint.
◆ displayName
 API_NavigatorAddOnViewPointData::displayName
The display name of the viewpoint.
◆ guid
 API_NavigatorAddOnViewPointData::guid
Unique ID of the viewpoint.
◆ iconId
 Int32 API_NavigatorAddOnViewPointData::iconId
◆ itemType
 API_NavigatorAddOnViewPointData::itemType
The type of the viewpoint: root, group or leaf node. See API_NavigatorAddOnViewPointTypeID.
◆ parentGuid
 API_NavigatorAddOnViewPointData::parentGuid
Unique ID of the parent root/group of the viewpoint. The parent of a root is APINULLGuid.
◆ viewSettingsFlags
 API_NavigatorAddOnViewPointData::viewSettingsFlags
Specifies which view settings are enabled in this viewpoint leaf node. Not applicable for viewpoint roots or groups. The value of this member can be set by combining the flags in API_NavigatorViewSettingsFlags.